

fltrVCF.bash v4.4 -- a script to filter vcf files repeatably

Dependencies required for fltrVCF to be fully functional:
	R
		tidyverse
		gridExtra
	vcftools
	vcflib
	samtools
	perl
	mawk
	parallel
	rad_haplotyper.pl https://github.com/cbirdlab/rad_haplotyper.git
	filter_hwe_by_pop_HPC

Tue Oct 5 13:26:26 CDT 2021 Reading options from command line:

	Settings File:            /work/hobi/jselwyn/Coryphopterus_RAD/config_files/fltrVCF_chya_C.config

	Cutoffs:                  10.1
	Path to BAM files:        /work/hobi/jselwyn/Coryphopterus_RAD/mkVCF_MiSeq
	PopMap File:              /work/hobi/jselwyn/Coryphopterus_RAD/mkVCF_MiSeq/mapped.10.1.bed
	VCF File:                 /work/hobi/jselwyn/Coryphopterus_RAD/fltrVCF_MiSeq/MiSeq_CHYA_Initial.10.1.Fltr02.2.recode.vcf.gz
	REF File:                 /work/hobi/jselwyn/Coryphopterus_RAD/mkREF_MiSeq/reference.10.1.fasta
	PopMap File:              /work/hobi/jselwyn/Coryphopterus_RAD/mkVCF_MiSeq/popmap.10.1
	Output file prefix:       MiSeq_chyaC
	Path to R scripts and other scripts:        /work/hobi/jselwyn/Coryphopterus_RAD/scripts/fltrVCF/scripts
	HWE Script:               /work/hobi/jselwyn/Coryphopterus_RAD/scripts/fltrVCF/filter_hwe_by_pop_HPC.pl
	Rad_Haplotyper script:    /work/hobi/jselwyn/Coryphopterus_RAD/scripts/rad_haplotyper/rad_haplotyper.pl
	Number of threads:          20

Tue Oct 5 13:26:26 CDT 2021 Reading options from config file and setting defaults
	SETTINGS are being loaded from file: '/work/hobi/jselwyn/Coryphopterus_RAD/config_files/fltrVCF_chya_C.config'
	Filters are set to '05 16 01 02 03 04 14 07 05 15 06 11 09 08 10 04 13 07 041 32 05 16 05 16 05 16 05 16 01 21'
	CutoffCode is set to '.10.1'
	BAM_PATH is set to '/work/hobi/jselwyn/Coryphopterus_RAD/mkVCF_MiSeq'
	SCRIPT_PATH is set to '/work/hobi/jselwyn/Coryphopterus_RAD/scripts/fltrVCF/scripts'
	VCF_FILE is set to '/work/hobi/jselwyn/Coryphopterus_RAD/fltrVCF_MiSeq/MiSeq_CHYA_Initial.10.1.Fltr02.2.recode.vcf.gz'
	Bed file is set to '/work/hobi/jselwyn/Coryphopterus_RAD/mkVCF_MiSeq/mapped.10.1.bed'
	Reference genome is set to '/work/hobi/jselwyn/Coryphopterus_RAD/mkREF_MiSeq/reference.10.1.fasta'
	PopMap is set to '/work/hobi/jselwyn/Coryphopterus_RAD/mkVCF_MiSeq/popmap.10.1'
	HWE_SCRIPT is set to '/work/hobi/jselwyn/Coryphopterus_RAD/scripts/fltrVCF/filter_hwe_by_pop_HPC.pl'
	RADHAP_SCRIPT is set to '/work/hobi/jselwyn/Coryphopterus_RAD/scripts/rad_haplotyper/rad_haplotyper.pl'
	Output file prefix is set to 'MiSeq_chyaC'
	The number of threads is set to '1'
	-P not set by user. Only filters that natively support parallelization will be run in parallel.
	Changing -v to existing file /work/hobi/jselwyn/Coryphopterus_RAD/fltrVCF_MiSeq/MiSeq_CHYA_Initial.10.1.Fltr02.2.recode.vcf for serial processing.  If you didn't want this to happen, turn on -P or change -v

Tue Oct 5 13:26:27 CDT 2021 Getting universal chromosome/contig prefix ...
          Querying /work/hobi/jselwyn/Coryphopterus_RAD/fltrVCF_MiSeq/MiSeq_CHYA_Initial.10.1.Fltr02.2.recode.vcf ...
          Prefix: 
          It is assumed that all values in the CHROM column of vcf begin with 
          If this is not the case, then fltrVCF will not work properly.
          The prefix is used to count SNPs/variants, contigs, etc and is used in some filters.

Tue Oct 5 13:26:27 CDT 2021  reading variables into MAIN

Tue Oct 5 13:26:27 CDT 2021 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
                                                                                                                        
                                         Histogram of the proportion of genotypes that are missing                      
                                                                                                                        
                 80000 +--------------------------------------------------------------------------------------------+   
                       |             ******   ******        +                  +                 +                  |   
                       |             *    *   *    ******  'sitemissingness' using (bin($1,binwidth)):(1.0) ******* |   
                 70000 |-+           *    *   *    *    *                                                         +-|   
                       |             *    *   *    *    *****                                                       |   
                       |             *    *   *    *    *   *                                                       |   
                 60000 |-+           *    *   *    *    *   ******                                                +-|   
                       |        ******    *   *    *    *   *    *                                                  |   
                       |        *    *    *   *    *    *   *    ******                               ******        |   
                 50000 |-+      *    *    *   *    *    *   *    *    **********             **********    *      +-|   
                       |        *    *    *   *    *    *   *    *    *   *    ***************   *    *    *****    |   
                 40000 |-+      *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  +-|   
                       |        *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *    |   
                       |        *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *    |   
                 30000 |-+      *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  +-|   
                       |        *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   **** |   
                       |        *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  * |   
                 20000 |-+      *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  *-|   
                       |    *****    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  * |   
                       |    *   *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  * |   
                 10000 |-+  *   *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  *-|   
                       |    *   *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  * |   
                       |    *   *    *    *   *    *    *   *    *    *   *    *   *    *    *   *    *    *   *  * |   
                     0 +--------------------------------------------------------------------------------------------+   
                       0                 0.2               0.4                0.6               0.8                 1   
                                                            Proportion Missing                                          
                                                                                                                        
                                                                                                                        
                                             Scatter plot of the proportion of genotypes that are missing.              
                                                                                                                        
                                1 +---------------------------------------------------------------------------------+   
                                  |***          +            +             +             +            +             |   
                              0.9 |-+****                                                 'sitemissingness'    *  +-|   
                                  |     ****                                                                        |   
                                  |        ****                                                                     |   
                              0.8 |-+         ****                                                                +-|   
                                  |              ****                                                               |   
                              0.7 |-+               ***                                                           +-|   
                                  |                   ****                                                          |   
                              0.6 |-+                    ****                                                     +-|   
                                  |                         ****                                                    |   
                              0.5 |-+                          ****                                               +-|   
                                  |                               ****                                              |   
                                  |                                  ****                                           |   
                              0.4 |-+                                   *****                                     +-|   
                                  |                                         *****                                   |   
                              0.3 |-+                                           ******                            +-|   
                                  |                                                  *****                          |   
                              0.2 |-+                                                    ******                   +-|   
                                  |                                                           *****                 |   
                                  |                                                               *****             |   
                              0.1 |-+                                                                 **          +-|   
                                  |             +            +             +             +            +**           |   
                                0 +---------------------------------------------------------------------------------+   
                                  0           200000       400000        600000        800000       1e+06        1.2e+06
                                                                         Site                                           
                                                                                                                        
     vcftools --vcf /work/hobi/jselwyn/Coryphopterus_RAD/fltrVCF_MiSeq/MiSeq_CHYA_Initial.10.1.Fltr02.2.recode.vcf --max-missing 0.5 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr05.1.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:40 CDT 2021 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
                                                                                                                        
                      Histogram of % missing data per individual|library before filter. Bars to the left are desireable.
                                                                                                                        
                                 70 +-------------------------------------------------------------------------------+   
                                    |               +               +               +               +               |   
                                    |                         'totalmissing' using (bin($1,binwidth)):(1.0) ******* |   
                                 60 |-+   *                                                                       +-|   
                                    |     **                                                                        |   
                                    |    ***                                                                        |   
                                    |    ***                                                                        |   
                                 50 |-+  ***                                                                      +-|   
                                    |    ***                                                                        |   
                                    |   ****                                                                        |   
                                 40 |-+ ****                                                                      +-|   
                                    |   ****                                                                        |   
                                    |   ****                                                                        |   
                                 30 |-+ ****                                                                      +-|   
                                    |   *****                                                                       |   
                                    |   *****                                                                       |   
                                 20 |-+ *****                                                                     +-|   
                                    |   ******     ** *     **                                                      |   
                                    | ********     ****  ** **                                                      |   
                                    | *********   ****** *****                                                      |   
                                 10 |-*************************   *                                           *   +-|   
                                    |***************************************   *** ** ** **   *     **  **    *     |   
                                    |*******************************************************************************|   
                                  0 +-------------------------------------------------------------------------------+   
                                    0              0.2             0.4             0.6             0.8              1   
                                                                   % missing genotypes                                  
                                                                                                                        
                                                                                                                        
                                          Scatter plot of % missing data per individual|library.                        
                                                                                                                        
                     1 +--------------------------------------------------------------------------------------------+   
                       |**         +           +           +           +           +           +           +        |   
                       | **                                                                     'imiss.dat'    *    |   
                       |   **                                                                                       |   
                       |    ***                                                                                     |   
                   0.8 |-+    ***                                                                                 +-|   
                       |        **                                                                                  |   
                       |         ***                                                                                |   
                       |           ***                                                                              |   
                   0.6 |-+           ***                                                                          +-|   
                       |               ***                                                                          |   
                       |                 **                                                                         |   
                       |                  ***                                                                       |   
                       |                    ****                                                                    |   
                   0.4 |-+                     ***                                                                +-|   
                       |                          ***                                                               |   
                       |                            ******                                                          |   
                       |                                 ******                                                     |   
                   0.2 |-+                                    ********                                            +-|   
                       |                                             *******                                        |   
                       |                                                   ******                                   |   
                       |                                                        ************************            |   
                       |           +           +           +           +           +           +       *************|   
                     0 +--------------------------------------------------------------------------------------------+   
                       0          100         200         300         400         500         600         700           
                                                                Individual                                              
                                                                                                                        
 58 individuals|libraries with too much missing data:
INDV
COPE_0472.fp2.repr
COPE_0486.fp2.repr
COPE_0487.fp2.repr
COPE_0489.fp2.repr
COPE_0502.fp2.repr
COPE_0540.fp2.repr
COPE_0553.fp2.repr
COPE_0562.fp2.repr
COPE_0571.fp2.repr
COPE_0578.fp2.repr
COPE_0598.fp2.repr
COPE_0628.fp2.repr
COPE_0641.fp2.repr
COPE_0679.fp2.repr
COPE_0698.fp2.repr
COPE_0707.fp2.repr
COPE_0745.fp2.repr
COPE_0777.fp2.repr
COPE_0779.fp2.repr
COPE_0792.fp2.repr
COPE_0811.fp2.repr
COPE_0817.fp2.repr
COPE_0827.fp2.repr
COPE_0835.fp2.repr
COPE_0839.fp2.repr
COPE_0858.fp2.repr
COPE_0869.fp2.repr
COPE_0880.fp2.repr
COPE_0884.fp2.repr
COPE_0905.fp2.repr
COPE_0935.fp2.repr
COPE_0946.fp2.repr
COPE_0957.fp2.repr
COPE_0978.fp2.repr
COPE_0984.fp2.repr
COPE_0986.fp2.repr
COPE_1012.fp2.repr
COPE_1013.fp2.repr
COPE_1033.fp2.repr
COPE_1052.fp2.repr
COPE_1066.fp2.repr
COPE_1077.fp2.repr
COPE_1082.fp2.repr
COPE_1088.fp2.repr
COPE_1090.fp2.repr
COPE_1113.fp2.repr
COPE_1147.fp2.repr
COPE_1151.fp2.repr
COPE_1162.fp2.repr
COPE_1182.fp2.repr
COPE_1192.fp2.repr
COPE_1193.fp2.repr
COPE_1204.fp2.repr
COPE_1213.fp2.repr
COPE_1214.fp2.repr
COPE_1217.fp2.repr
COPE_1228.fp2.repr
COPE_1239.fp2.repr
     vcftools --vcf MiSeq_chyaC.10.1.Fltr05.1.recode.vcf --remove MiSeq_chyaC.10.1.Fltr16.2.lowDP-2.indv --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr16.2.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Tue Oct 5 13:26:43 CDT 2021 ---------------------------FILTER01: Remove sites with Y < alleles < X -----------------------------
     vcftools --vcf MiSeq_chyaC.10.1.Fltr16.2.recode.vcf --min-alleles 2 --max-alleles 2 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr01.3.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:43 CDT 2021 ---------------------------FILTER02: Remove Sites with Indels -----------------------------
     vcftools --vcf MiSeq_chyaC.10.1.Fltr01.3.recode.vcf --remove-indels --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr02.4.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:44 CDT 2021 ---------------------------FILTER03: Remove Sites with QUAL < minQ -----------------------------
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'QUALbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'QUALbefore' pt "*"
                                 ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr02.4.recode.vcf --minQ 40 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr03.5.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:44 CDT 2021 ---------------------------FILTER04: Remove Sites With Mean Depth of Coverage < min-meanDP -----------------------------
cut: MiSeq_chyaC.10.1.Fltr04.6.ldepth.mean: No such file or directory
cut: MiSeq_chyaC.10.1.Fltr04.6.ldepth.mean: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' pt "*"
                                          ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthVSvariance' pt "*"
                                          ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr03.5.recode.vcf --min-meanDP 10 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr04.6.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:45 CDT 2021 ---------------------------FILTER14: If individual's genotype has DP < X, convert to missing data -----------------------------
cut: MiSeq_chyaC.10.1.Fltr14.7.gdepth: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'genotypedepthbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'genotypedepthbefore' pt "*"
                                          ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr04.6.recode.vcf --minDP 5 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr14.7.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:45 CDT 2021 ---------------------------FILTER07: Remove sites with Alternate Allele Count <=X -----------------------------
     vcffixup MiSeq_chyaC.10.1.Fltr14.7.recode.vcf | vcffilter -s -f "AC > 3 & AN - AC > 3"  > MiSeq_chyaC.10.1.Fltr07.8.vcf
	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:46 CDT 2021 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: MiSeq_chyaC.10.1.Fltr05.9.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*"
                                      ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr07.8.vcf --max-missing 0.7 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr05.9.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:46 CDT 2021 ---------------------------FILTER15: Remove sites with maf > minor allele frequency > max-maf -----------------------------
     vcftools --vcf MiSeq_chyaC.10.1.Fltr05.9.recode.vcf --maf 0.005 --max-maf 0.995 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr15.10.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:46 CDT 2021 ---------------------------FILTER06: Remove sites with Average Allele Balance deviating too far from 0.5 while keeping those with AB=0  -----------------------------
Broken VCF header, no column names?
 at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 172.
	Vcf::throw(Vcf4_2=HASH(0xb1da78), "Broken VCF header, no column names?") called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 867
	VcfReader::_read_column_names(Vcf4_2=HASH(0xb1da78)) called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 602
	VcfReader::parse_header(Vcf4_2=HASH(0xb1da78)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 212
	main::read_data(HASH(0xad4f58)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 12
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'siteAB.dat' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'siteAB.dat' pt "*"
                                 ^
         line 0: x range is invalid

     vcffixup MiSeq_chyaC.10.1.Fltr15.10.recode.vcf | vcffilter -s -f "AB > 0.2 & AB < 0.8 | AB = 0"  > MiSeq_chyaC.10.1.Fltr06.11.vcf
	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:47 CDT 2021 ---------------------------FILTER11: Remove sites with Quality/DP ratio < X -----------------------------
     vcffilter -s -f "QUAL / DP > 0.2" MiSeq_chyaC.10.1.Fltr06.11.vcf > MiSeq_chyaC.10.1.Fltr11.12.vcf
	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:47 CDT 2021 ---------------------------FILTER09: Remove sites with low/high ratio of mean mapping quality of alt to ref -----------------------------
     vcffilter -s -f "MQM / MQMR > 0.75 & MQM / MQMR < 1.33333" MiSeq_chyaC.10.1.Fltr11.12.vcf > MiSeq_chyaC.10.1.Fltr09.13.vcf
	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:48 CDT 2021 ---------------------------FILTER08: Remove sites covered by both F and R reads-----------------------------
     vcffilter -s -f "SAF / SAR > 10 & SRF / SRR > 10 | SAR / SAF > 10 & SRR / SRF > 10" MiSeq_chyaC.10.1.Fltr09.13.vcf > MiSeq_chyaC.10.1.Fltr08.14.vcf
	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:48 CDT 2021 ---------------------------FILTER10: Remove sites with one allele only supported by reads not properly paired -----------------------------
     vcffilter -s -f "PAIRED > 0.05 & PAIREDR > 0.05 & PAIREDR / PAIRED < 1.75 & PAIREDR / PAIRED > 0.25 | PAIRED < 0.05 & PAIREDR < 0.05" MiSeq_chyaC.10.1.Fltr08.14.vcf > MiSeq_chyaC.10.1.Fltr10.15.vcf
	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:48 CDT 2021 ---------------------------FILTER04: Remove Sites With Mean Depth of Coverage < min-meanDP -----------------------------
cut: MiSeq_chyaC.10.1.Fltr04.16.ldepth.mean: No such file or directory
cut: MiSeq_chyaC.10.1.Fltr04.16.ldepth.mean: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                         ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitedepthmeanbefore' pt "*"
                                          ^
         line 0: x range is invalid

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthVSvariance' pt "*"
                                          ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr10.15.vcf --min-meanDP 10 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr04.16.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:49 CDT 2021 ---------------------------FILTER13: Remove sites with mean DP greater than X  -----------------------------
cut: MiSeq_chyaC.10.1.Fltr13.17.ldepth: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'meandepthpersitebefore' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                            ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr04.16.recode.vcf --max-meanDP 150 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr13.17.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:50 CDT 2021 ---------------------------FILTER07: Remove sites with Alternate Allele Count <=X -----------------------------
     vcffixup MiSeq_chyaC.10.1.Fltr13.17.recode.vcf | vcffilter -s -f "AC > 3 & AN - AC > 3"  > MiSeq_chyaC.10.1.Fltr07.18.vcf
	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:50 CDT 2021 ---------------------------FILTER041: Remove Contigs With Extreme DP -----------------------------
tail: cannot open ‘MiSeq_chyaC.10.1.Fltr041.19.ldepth.mean’ for reading: No such file or directory
── Attaching packages ────────────────────────────────── tidyverse 1.3.0.9000 ──
✔ ggplot2 3.3.5     ✔ purrr   0.3.4
✔ tibble  3.1.4     ✔ dplyr   1.0.7
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.3.1     ✔ forcats 0.5.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

Attaching package: ‘gridExtra’

The following object is masked from ‘package:dplyr’:

    combine

Error in read.table(inputFile, header = FALSE, sep = "\t") : 
  no lines available in input
Execution halted
 The following contigs have been filtered:

 Plots output to MiSeq_chyaC.10.1.Fltr041.19.ldepth.mean.contigs.pdf

Tue Oct 5 13:26:53 CDT 2021 ---------------------------FILTER32: Keep Contigs w Fewer Heterozygotes -----------------------------
MiSeq_chyaC.10.1.Fltr041.19.vcf
0.67
Broken VCF header, no column names?
 at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 172.
	Vcf::throw(Vcf4_2=HASH(0xb21758), "Broken VCF header, no column names?") called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 867
	VcfReader::_read_column_names(Vcf4_2=HASH(0xb21758)) called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 602
	VcfReader::parse_header(Vcf4_2=HASH(0xb21758)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 212
	main::read_data(HASH(0xad4f58)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 12
Broken VCF header, no column names?
 at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 172.
	Vcf::throw(Vcf4_2=HASH(0xb21748), "Broken VCF header, no column names?") called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 867
	VcfReader::_read_column_names(Vcf4_2=HASH(0xb21748)) called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 602
	VcfReader::parse_header(Vcf4_2=HASH(0xb21748)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 212
	main::read_data(HASH(0xad4f58)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 12
Error: Can't rename columns that don't exist.
✖ Column `X1` doesn't exist.
Backtrace:
     █
  1. ├─`%>%`(...)
  2. ├─tidyr::separate(...)
  3. ├─dplyr::filter(., str_detect(value, "\\.", negate = TRUE))
  4. ├─dplyr::mutate(., value = str_remove(value, "\\]"))
  5. ├─tidyr::separate(., value, sep = "=", into = c("id", "value"))
  6. ├─dplyr::select(., -name)
  7. ├─tidyr::pivot_longer(., cols = starts_with("X"))
  8. ├─dplyr::rename(., locus = X1, ref_allele = X2)
  9. └─dplyr:::rename.data.frame(., locus = X1, ref_allele = X2)
 10.   └─tidyselect::eval_rename(expr(c(...)), .data)
 11.     └─tidyselect:::rename_impl(...)
 12.       └─tidyselect:::eval_select_impl(...)
 13.         ├─tidyselect:::with_subscript_errors(...)
 14.         │ ├─base::tryCatch(...)
 15.         │ │ └─base:::tryCatchList(expr, classes, parentenv, handlers)
 16.         │ │   └─base:::tryCatchOne(expr, names, parentenv, handlers[[1L]])
 17.         │ │     └─base:::doTryCatch(return(expr), name, parentenv, handler)
 18.         │ └─tidyselect:::instrument_base_errors(expr)
 19.         │   └─base::withCallingHandlers(...)
 20.         └─tidyselect:::vars_select_eval(...)
 21.           └─tidyselect:::walk_data_tree(expr, data_mask, context_mask)
 22.             └─tidyselect:::eval_c(expr, data_mask, context_mask)
 23.               └─tidyselect:::reduce_sels(node, data_mask, context_mask, init = init)
 24.                 └─tidyselect:::walk_data_tree(new, data_mask, context_mask)
 25.                   └─tidyselect:::as_indices_sel_impl(...)
 26.                     └─tidyselect:::as_indices_impl(x, vars, strict = strict)
 27.                       └─tidyselect:::chr_as_locations(x, vars)
 28.                         └─vctrs::vec_as_location(x, n = length(vars), names = vars)
 29.                           └─(function () ...
 30.                             └─vctrs:::stop_subscript_oob(...)
 31.                               └─vctrs:::stop_subscript(...)
Warning message:
`data_frame()` was deprecated in tibble 1.1.0.
Please use `tibble()` instead.
This warning is displayed once every 8 hours.
Call `lifecycle::last_warnings()` to see where this warning was generated. 
Execution halted
── Attaching packages ────────────────────────────────── tidyverse 1.3.0.9000 ──
✔ ggplot2 3.3.5     ✔ purrr   0.3.4
✔ tibble  3.1.4     ✔ dplyr   1.0.7
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.3.1     ✔ forcats 0.5.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

Attaching package: ‘gridExtra’

The following object is masked from ‘package:dplyr’:

    combine

Error in read.table(inputFile, header = FALSE, sep = "\t") : 
  no lines available in input
Execution halted

 The following contigs have been filtered:

 Plots output to MiSeq_chyaC.10.1.Fltr32.20.hetero.contigs.plots.pdf

	Sites remaining:	0
	Contigs remaining:	0

Tue Oct 5 13:26:58 CDT 2021 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: MiSeq_chyaC.10.1.Fltr05.21.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*"
                                      ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr32.20.vcf --max-missing 0.7 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr05.21.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:58 CDT 2021 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open MiSeq_chyaC.10.1.Fltr16.22.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open MiSeq_chyaC.10.1.Fltr16.22.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf MiSeq_chyaC.10.1.Fltr05.21.recode.vcf --remove MiSeq_chyaC.10.1.Fltr16.22.lowDP-2.indv --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr16.22.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Tue Oct 5 13:26:59 CDT 2021 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: MiSeq_chyaC.10.1.Fltr05.23.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*"
                                      ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr16.22.recode.vcf --max-missing 0.75 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr05.23.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:26:59 CDT 2021 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open MiSeq_chyaC.10.1.Fltr16.24.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open MiSeq_chyaC.10.1.Fltr16.24.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf MiSeq_chyaC.10.1.Fltr05.23.recode.vcf --remove MiSeq_chyaC.10.1.Fltr16.24.lowDP-2.indv --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr16.24.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Tue Oct 5 13:27:00 CDT 2021 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: MiSeq_chyaC.10.1.Fltr05.25.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*"
                                      ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr16.24.recode.vcf --max-missing 0.8 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr05.25.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:27:00 CDT 2021 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open MiSeq_chyaC.10.1.Fltr16.26.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open MiSeq_chyaC.10.1.Fltr16.26.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf MiSeq_chyaC.10.1.Fltr05.25.recode.vcf --remove MiSeq_chyaC.10.1.Fltr16.26.lowDP-2.indv --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr16.26.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Tue Oct 5 13:27:01 CDT 2021 ---------------------------FILTER05: Remove sites called in <X proportion of individuals -----------------------------
cut: MiSeq_chyaC.10.1.Fltr05.27.lmiss: No such file or directory
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                     ^
         line 0: all points y value undefined!

         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'sitemissingness' pt "*"
                                      ^
         line 0: x range is invalid

     vcftools --vcf MiSeq_chyaC.10.1.Fltr16.26.recode.vcf --max-missing 0.85 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr05.27.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:27:02 CDT 2021 ---------------------------FILTER16: Remove Individuals|Libraries with Too Much Missing Data-----------------------------
mawk: cannot open MiSeq_chyaC.10.1.Fltr16.28.imiss (No such file or directory)
         line 0: warning: Skipping data file with no valid points

gnuplot> plot 'totalmissing' using (bin($1,binwidth)):(1.0) smooth freq with boxes
                                                                                  ^
         line 0: all points y value undefined!

         line 0: Non-numeric string found where a numeric expression was expected

         line 0: warning: Skipping data file with no valid points
         line 0: Can't plot with an empty x range!

mawk: cannot open MiSeq_chyaC.10.1.Fltr16.28.imiss (No such file or directory)
 0 individuals|libraries with too much missing data:
     vcftools --vcf MiSeq_chyaC.10.1.Fltr05.27.recode.vcf --remove MiSeq_chyaC.10.1.Fltr16.28.lowDP-2.indv --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr16.28.recode.vcf 2> /dev/null | vcffixup -
	Sites remaining:	0
	Contigs remaining:	0


 Individuals|Libraries Remaining Per Sample

Tue Oct 5 13:27:05 CDT 2021 ---------------------------FILTER01: Remove sites with Y < alleles < X -----------------------------
     vcftools --vcf MiSeq_chyaC.10.1.Fltr16.28.recode.vcf --min-alleles 2 --max-alleles 2 --recode --recode-INFO-all --out MiSeq_chyaC.10.1.Fltr01.29.recode.vcf 2> /dev/null
	Sites remaining:	0
	Contigs remaining:	0


Tue Oct 5 13:27:05 CDT 2021 ---------------------------FILTER21: Select Most Informative SNP per Contig -----------------------------
Broken VCF header, no column names?
 at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 172.
	Vcf::throw(Vcf4_2=HASH(0xb1da68), "Broken VCF header, no column names?") called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 867
	VcfReader::_read_column_names(Vcf4_2=HASH(0xb1da68)) called at /home/apps/vcftools/gcc7/0.1.16/share/perl5/Vcf.pm line 602
	VcfReader::parse_header(Vcf4_2=HASH(0xb1da68)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 212
	main::read_data(HASH(0xad4f58)) called at /home/apps/vcftools/gcc7/0.1.16/bin/vcf-query line 12
-1
-1
0

Tue Oct 5 13:27:07 CDT 2021  --------------------------- Filtering complete! ---------------------------


Tue Oct 5 13:27:07 CDT 2021 Running fltrVCFstats2 with the following settings...
          DIRECTORY: /work/hobi/jselwyn/Coryphopterus_RAD/fltrVCF_MiSeq3
          THREADS: 20
          FILE PREFIX: MiSeq_chyaC

Tue Oct 5 13:27:07 CDT 2021 Getting universal chromosome/contig prefix ...
          Querying  ...
          Prefix: 
          It is assumed that all values in the CHROM column of vcf begin with 
          If this is not the case, then fltrVCF will not work properly.

Tue Oct 5 13:27:07 CDT 2021 Making column 1 of 19 ...

Tue Oct 5 13:27:07 CDT 2021 Making column 2 of 19 ...

Tue Oct 5 13:27:07 CDT 2021 Making column 3 of 19 ...

Tue Oct 5 13:27:08 CDT 2021 Making column 4 of 19 ...

Tue Oct 5 13:27:08 CDT 2021 Making column 5 of 19 ...

Tue Oct 5 13:27:09 CDT 2021 Making column 6 of 19 ...

Tue Oct 5 13:27:09 CDT 2021 Making column 7 of 19 ...

Tue Oct 5 13:27:09 CDT 2021 Making column 8 of 19 ...

Tue Oct 5 13:27:09 CDT 2021 Making column 9 of 19 ...

Tue Oct 5 13:27:10 CDT 2021 Making column 10 of 19 ...

Tue Oct 5 13:27:10 CDT 2021 Making column 11 of 19 ...

Tue Oct 5 13:27:10 CDT 2021 Making column 12 of 19 ...

Tue Oct 5 13:27:11 CDT 2021 Making column 13 of 19 ...

Tue Oct 5 13:27:11 CDT 2021 Making column 14 of 19 ...

Tue Oct 5 13:27:11 CDT 2021 Making column 15 of 19 ...

Tue Oct 5 13:27:12 CDT 2021 Making column 16 of 19 ...

Tue Oct 5 13:27:12 CDT 2021 Making column 17 of 19 ...

Tue Oct 5 13:27:13 CDT 2021 Making column 18 of 19 ...

Tue Oct 5 13:27:13 CDT 2021 Making column 19 of 19 ...

Tue Oct 5 13:27:13 CDT 2021 Assembling tidy data table...

Tue Oct 5 13:27:14 CDT 2021 Plotting results...
Warning messages:
1: Removed 30 row(s) containing missing values (geom_path). 
2: Removed 30 rows containing missing values (geom_point). 
Warning messages:
1: Removed 210 row(s) containing missing values (geom_path). 
2: Removed 210 rows containing missing values (geom_point). 
null device 
          1 

Tue Oct 5 13:27:18 CDT 2021 fltrVCFstats2 complete!
